Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/M05.tmx
Source language: en_us
Languages: zh_cn

source: The replacements
zh_cn: 替代者

source: When the alien overlords came, they did not arrive in giant spaceships intent on destroying the earth, nor were they hulking metal invaders or slathering, poly-mouthed monstrosities.
zh_cn: 外星人来了，它们没有乘坐足以毁灭地球的巨大太空飞船。它们不是遍覆金属的巨型入侵者，也不是浑身黏液，四处开口的怪兽。

source: They were small, delicate creatures- helpless-looking really- but they made it clear they were here to rule. Mankind had had its day- they were our replacements.
zh_cn: 它们看起来弱小而无助，但是它们清楚，它们是来统治一切的，并且，它们做到了——它们就是我们人类的替代者。

source: I was in the woods, camping alone, when it started.
zh_cn: 事情发生时，我独自在森林中野营。

source: I'd told Carol I needed some time to think about where our relationship was going, but I'd spent most of the time sitting under the canvas porch drinking whiskey macs with my cagoule hood tight around my head.
zh_cn: 我告诉卡罗尔（Carol）我需要一些时间来整理我们之间的关系，实际上，大部分时间我都呆坐在帐篷门口，裹着防风衣，灌着威士忌麦克（一种鸡尾酒）。

source: I hadn't looked in a mirror in over a week.
zh_cn: 我已经一个多星期没有照镜子了。

source: I was packing up when I got the call from Bodge.
zh_cn: 在我正要打包准备回去时，接到了波什（Bodge）的电话。

source: "Don't go home," he said. "Meet me in the bunker."
zh_cn: “别回去，”他说，“到地堡来见我。”

source: "Carol's expecting me," I said.
zh_cn: “可是卡罗尔在等我，”我说。

source: "They're here man," he whispered. "Did you not see the meteor shower?"
zh_cn: “它们来了伙计，”他轻声道，“你没看见流星雨吗？”

source: He told me they'd come down a few days ago, with shooting stars that seemed innocuous at first- but then people started acting weird.
zh_cn: 他告诉我它们是几天前落地的，乍一看去好似无害的流星，但是马上，人们就开始出现奇怪的行为。

source: The prime minister was on the news telling everyone everything was fine, but people were acting like zombies- without the cannibalism.
zh_cn: 首相在新闻上通告说一切都很正常，可是人们都变得像僵尸一样——不吃人肉而已。

source: "You can tell the ones who've been got to by the way they look," Bodge said.
zh_cn: “那些被控制了的人看起来说不出的怪，”波什说。

source: "They'll be totally exhausted, they'll be unable to say almost anything interesting, they'll be dressed badly like they don't care anymore.
zh_cn: “他们都累极了，一句有趣的话也说不上，而且好像一点也不在乎自己的打扮。

source: If you speak to one, they'll tell you they're happy but they'll look suicidal."
zh_cn: 要是你问起来，他们就会说他们很开心，但是他们看起来像是要自杀。”

source: "What do you mean? I said.
zh_cn: “什么意思？”我问。

source: "What's wrong with them?"
zh_cn: “发生了什么？”

source: "They've been got. They're hosts now.
zh_cn: “他们被控制了，变成宿主了。

source: I've seen them man- their little big heads and their vacant little eyes.
zh_cn: 我见过它们伙计——不成比例的头还有空洞的小眼睛。

source: They're space parasites, like face-huggers but on the chest- chest-huggers.
zh_cn: 它们是来自太空的寄生虫，就像盖在胸部的覆面虫，对，覆胸虫。

source: They like women more than men.
zh_cn: 它们好像更喜欢控制女人。

source: They're everywhere.
zh_cn: 它们已经到处都是了。

source: The government's been taken over.
zh_cn: 政府也被控制了。

source: Carol's been got too- I saw her yesterday and she was looking for you.
zh_cn: 卡罗尔也一样——我昨天见过她了，她正在找你。

source: Don't go home, man.
zh_cn: 别回家了伙计。

source: I've seen them take two people at a time."
zh_cn: 我看见过，它们能同时控制两个人。”

source: Of course, home is exactly where I did go, figuring Bodge had been smoking something again.
zh_cn: 不过，我还是回家了，波什大概又吸了粉在胡说了吧。

source: Everything seemed normal on my street- a little quiet, but not the apocalypse.
zh_cn: 路上一切正常——有些安静，但不是末日那样的死寂。

source: I pulled the car into the driveway and got out.
zh_cn: 我把车停在路上，下了车。

source: The lights were on in the living room, the electric aura seeping around the edges of the curtains.
zh_cn: 客厅的灯亮着，光线从窗帘的缝隙中透出来。

source: I closed the car door quietly, leaving my kit in the boot.
zh_cn: 我安静地关上了车门，把家伙都留在了行李箱里面。

source: I'd left pretty suddenly.
zh_cn: 我当时离开得有些突然。

source: Somehow, she heard me coming. I had my key poised for the lock when the door swung open.
zh_cn: 她好像听到了我回来的声音，我刚把钥匙插进锁孔门就开了。

source: "It's you," she said.
zh_cn: “你回来了，”她说。

source: "It's me," I replied.
zh_cn: “是的，”我回答道。

source: "You look awful... and you stink too."
zh_cn: “你看起来真乱，还臭烘烘的。”

source: "I've been camping."
zh_cn: “我野营去了。”

source: "I know where you've been," she said.
zh_cn: “我知道你干嘛去了，”她说。

source: "Are you finished with it?"
zh_cn: “你完事儿了？

source: "With what?"
zh_cn: “什么事？”

source: "Living like a hobo."
zh_cn: “像流浪汉一样过日子。

source: "I'd like a shower."
zh_cn: “我需要洗个澡。”

source: She stepped away from the door.
zh_cn: 她从门前退开。

source: "You'd best come in."
zh_cn: “进来吧。”

source: "A shower, a shit and a shave, that's what I need," I said- but she didn't laugh.
zh_cn: “我需要洗个澡，拉个屎，刮个胡子，就这些了，”我说——可是她没有笑。

source: I started to notice how tired she looked, how drawn and taut her skin was.
zh_cn: 我这才注意到她看起来有多么疲惫憔悴，皮肤也紧地发皱。

source: She was dressed in this old, black flannel dressing gown with bits of dried porridge stuck to the side.
zh_cn: 她穿了一身旧衣服，黑色的法兰绒晨衣侧面还有一块已经干了的粥。

source: "Have you lost weight?" I said.
zh_cn: “你瘦了么？”我问。

source: "Jim, we need to talk."
zh_cn: “吉姆（Jim），我们得谈谈。”

source: And that was when I saw it.
zh_cn: 于是我看见了它。

source: The right-hand side of her dressing gown slipped down a little and I caught a glimpse of its pink, bulbous head leering at me from the shadows, its tiny arms clinging tight to her side, its little lips wet from feeding on her.
zh_cn: 她右侧的衣服滑下来了一点，我瞥见了它粉色的球状的脑袋，它在阴影中看着我。它的小手紧紧地抓在她身侧，它的嘴唇因为吮吸她而十分湿润。

source: Its mouth dropped open and it began to scream- alerting its kind to the presence of the uninfected.
zh_cn: 它长大了嘴，开始尖叫——以它们的方式发出发现未感染者的警报。

source: I looked up at Carol and saw her beautiful brown eyes were now the colour of dusty earth.
zh_cn: 我抬头看着卡罗尔，她美丽的棕色眼睛仿佛被尘埃掩盖。

source: She was a goner- what Bodge would later call a 'half wife'- a slave to the creatures.
zh_cn: 她已是将死之人——后来波什称这样的女人为“半妻”——是那种生物的奴隶。

source: I backed out, stumbling along the driveway to my car. I headed straight to Bodge's basement.
zh_cn: 我退着出了门，踉跄地跑向我的车，笔直朝波什的地下室驶去。

source: "What kept you?" he said, when I came clattering down the stairs.
zh_cn: “怎么这么久？”在我爬下梯子时，他问道。

source: "I went to Carol's," I said.
zh_cn: “我去找卡罗尔了，”我说。

source: "I have to save her."
zh_cn: “我必须救她。”

source: Bodge cracked open a can of lager and handed it to me, frothy beer-juice running over my hands.
zh_cn: 波什撬开一瓶啤酒，递给我，啤酒泡泡溢到了我的手上。

source: "There's nothing you can do," he said.
zh_cn: “你什么也做不了，”他说。

source: "She's lost to us now."
zh_cn: “我们失去她了。”

source: "So what do we do?" I said.
zh_cn: “那我们现在该做什么？”我问。

source: "We resist," he replied.
zh_cn: “我们要生存，”他回答道。

source: Then he picked up a replica gun attached his games console and pulled a silent trigger.
zh_cn: 然后他一把抓起还连在游戏机上的模型枪，扣下了无声的扳机。

source: We soon found out we weren't alone.
zh_cn: 我们很快发现我们并不孤独。

source: There were others holding out- the resistance- but there was no official opposition.
zh_cn: 还有些人同样坚持了下来——他们也生存着。但是没有官方力量。

source: The government, the army, everyone who counted, they were rolling over and pretending like nothing was happening.
zh_cn: 政府、军队，他们都假装什么都没有发生一样，一切照常。

source: We came to understand they were all under the control of our extra-terrestrial replacements.
zh_cn: 我们明白他们都已经被来自外星的替代者控制了。

source: Beneath their suits, their jackets, their blouses- was one of those little critters sucking them dry, controlling their every thought and move so that their lives were no longer their own.
zh_cn: 在他们的制服、夹克、袖子下，一只只小怪物正在把他们吸干。它们控制了他们的思想、行动，他们不再“活着”了。

source: The world was run being run by the critters- to what end, we did not know.
zh_cn: 整个世界都被那些生物控制了，它将何去何从，我们无从得知。

source: It came down to basements full of desperate, unshaven men- creased shirts, holey jeans, beer-slicked moustaches and long hours target practice on games consoles (live ammo was in short supply).
zh_cn: 绝望弥漫在地下室中。胡子拉碴的男人，褶皱的衬衫，破旧的牛仔裤，浸满啤酒的胡子，还有长时间利用游戏控制器的瞄准练习（弹药是稀缺资源）。

source: Generally, the women fell like we knew they would- the fairer sex was the weaker sex- and few lasted beyond the first months of the occupation.
zh_cn: 女人像我们预料的那样——越漂亮就越弱小——在统治开始的头几个月就消失殆尽了。

source: They were never strong enough to resist the replacements' powers for long and they joined the ranks of the thralls.
zh_cn: 她们无法抵抗那样长的时间，都沦为了奴役。

source: All it took was one look from the aliens, and the women were swooning.
zh_cn: 外星人只要看她们一眼，她们就昏厥了。

source: They couldn't see them for what they were. The mind control was too powerful.
zh_cn: 女人们都看不到它们的样子，意识控制的力量太强大了。

source: And slowly, our merry band began to disappear.
zh_cn: 可是逐渐地，我们这个小团体开始消逝了。

source: At one time there were eight of us in the bunker: Bodge and me- of course- and then Ray, Jason, Matt, Elvis, Ginge, Big John and Alan.
zh_cn: 地堡中曾经有八个人：波什和我——毋庸置疑——还有雷（Ray），詹森（Jason），马特（Matt），埃尔维斯（Elvis），京（Ginge），老约翰（Big John）和艾伦（Alan）。

source: We kept each other in good spirits while the world went to hell outside, falling under the replacements' spell- society ordering itself only around their needs.
zh_cn: 我们相互鼓舞，抵挡地上地狱般的世界。在替代者的统治下，人类社会已经沦陷，社会仅以活着为目的运转着。

source: Jason told us he needed to go back to his old place to get some things, but he just never came back.
zh_cn: 詹森告诉我们说他要回家里取些东西，但是他再没有回来。

source: A few weeks later, we saw him walking in endless circles around the park with his old girlfriend- and we knew she'd been got.
zh_cn: 几星期后，我们看见他和他旧日的女友（我们早就知道她被控制了），绕着公园无止尽地走着。

source: He gave Bodge and I a look as if he didn't recognise us, and we saw the shifting bulge of the replacement beneath his girl's jacket.
zh_cn: 他看了我和波什一眼，却好像没有认出来。我们发现了她女友鼓起的夹克，那是替代者。

source: He'd been mind-washed.
zh_cn: 他被洗脑了。

source: Most replacements took more than one host- and once they'd latched onto a woman they usually sought a man next, their oily suckers poking out from their corpulent little organ sacs in search of a Y chromosome.
zh_cn: 大部分替代者控制着不止一个宿主——它们一旦控制了一个女人，就开始寻找男人。它们从鼓起的囊中伸出油腻的吸嘴，寻找Y染色体。

source: They got Matt after that, then Ray.
zh_cn: 后来马特也被控制了，雷则是下一个。

source: They left for supplies and we never saw them again.
zh_cn: 他们出去寻找补给接着就失踪了。

source: Sometimes I think they wanted to be got, that they couldn't handle the resistance life anymore.
zh_cn: 有时我在想他们或许再也无法忍受这样的苟延残喘，故意被控制了。

source: They gave themselves up.
zh_cn: 他们自己放弃了。

source: Things were looking grim.
zh_cn: 事情越来越糟。

source: There were just five of us left and Big John and Ginge were getting serious cabin fever.
zh_cn: 我们只剩下了五个人，老约翰和京还得了严重的幽闭症。

source: Then, one day, Bodge made a discovery.
zh_cn: 终于有一天，波什有了发现。

source: We'd known for a while that alcohol repelled the creatures- but only to an extent.
zh_cn: 我们早就知道酒精能够抵挡那些生物——只是一定程度上。

source: Get too close and they'd still make you theirs, maybe just out of spite- especially if they already had a woman.
zh_cn: 一旦靠得太近，他们还是能够控制你，可能只是为了出气——特别是当它们已经控制了一个女人的时候。

source: They were dangerous, these possessed women- the half-wives.
zh_cn: 那些被控制的女人——所谓的半妻，她们很危险。

source: They moved quickly and they didn't let up.
zh_cn: 她们移动迅速而且不知疲倦。

source: So you had to be careful, drink just enough to keep you safe, not too much to make bad judgements.
zh_cn: 所以你必须要小心。喝足够的的酒来保命，喝过头就有可能遭殃。

source: The tipsy survived but the drop-down drunk got beholden.
zh_cn: 走路不稳的人活了下来，醉倒的就被控制了。

source: Bodge had been working on a formula for a while- a kind of repellent spray- something to keep us safe in the outside world.
zh_cn: 波什花了很多时间来研制一种配方——一种驱逐喷剂——它可以让我们从外面的世界活着回来。

source: He came racing down the basement stairs one morning to say he'd done it- he'd had his eureka moment.
zh_cn: 一天早上，他冲下梯子，告诉我们他做到了——他发现了自己的新大陆。

source: He'd spent the whole night in the company of thralls, half-wives, the beholden- and nothing.
zh_cn: 他一晚上都和那些被控制的人、半妻在一起，却一点事也没有。

source: He'd watched as the pulsating little creatures- latched onto all that surrounded him- turned and shrieked at his presence, driving their host humans away and leaving a kind of cordon sanitaire surrounding him.
zh_cn: 他看着那些小生物——每一个接近他的——转身尖叫，驱使着它们的宿主跑开，好像他周围有一圈防疫封锁线一样。

source: Bodge called it a 'circle of life'.
zh_cn: 波什称之为“生命之圈”。

source: With his repellent on, not even crazed half-wives would come within ten feet of him.
zh_cn: 喷了他的喷剂，就算是最疯狂的半妻也不会靠近他十英尺之内。

source: "Six parts lager, two parts gin, one part whiskey, half a curry, and thirty cigarettes," he said.
zh_cn: “六分贮藏啤酒，两份杜松子酒，一份威士忌，半份咖喱再加上三十支烟，”他说。

source: "Is it a cure?" I asked.
zh_cn: “这是治疗药剂？”我问道。

source: He narrowed his eyes at me.
zh_cn: 他眯起眼睛看着我。

source: "Don't you see?" he said.
zh_cn: “你看不到么？”他说。

source: If we manufacture this on a global scale all men in the world will be safe."
zh_cn: 如果我们大量生产，那么全世界的人就都得救了。

source: "Will it work on women?"
zh_cn: “它对女人也有效果么？”

source: "The women are all gone, man."
zh_cn: “女人都完蛋了，伙计。”

source: He put his hand on my shoulder and signalled to Alan.
zh_cn: 他把手搭在我的肩上，示意艾伦。

source: Alan nodded at Big John and Big John reached into the fridge and pulled out a beer.
zh_cn: 艾伦对老约翰点点头，老约翰走到冰箱那儿拿出了一罐啤酒。

source: Bodge caught it with his other hand and lifted the ring pull up with just one finger.
zh_cn: 波什用另一只手接住了啤酒用一根手指勾起了拉环。

source: "Only the strong survive," he said.
zh_cn: “只有最强大的才能活下来，”他说。

source: But I was gone that very same evening, as soon as the 'resistance' had passed out in front of Modern Warfare 3.
zh_cn: 当晚，我离开了，就在驱逐药剂分发的那一夜。

source: I took Bodge's formula, spraying some on myself and keeping more in an atomiser, and headed to Carol's.
zh_cn: 我取了一些波什的喷剂，喷了些在身上，剩下的装进了喷雾器中，动身去找卡罗尔。

source: I'd been thinking about her for months, wanting so badly to see her again, though I hadn't told anyone.
zh_cn: 这几个月来我一直在想她，期待着能够再次见到她，尽管我谁也没说。

source: That was quitter talk. That was the kind of talk that got Jason, Matt and Ray suckered.
zh_cn: 那是半途而废的人说的话，詹森、马特还有雷最厌恶这种话。

source: The lights were on when I pulled up, just like before.
zh_cn: 我停车，发现灯依然亮着，和之前一样。

source: It was amazing to see how similar the world looked despite the change in ownership- how everything seemed to run as normal.
zh_cn: 世界的主人改变了，可是却神奇地保留了它原来的模样——看起来一切正常。

source: I knew that was one of their tricks, but still.
zh_cn: 我知道这只是它们的把戏罢了，可那又如何。

source: I rang the bell, atomiser at the ready, hoping that Bodge's formula really worked, praying it was strong enough to drive the monstrous little creature out of Carol.
zh_cn: 我按响了门铃，喷雾器已经准备好了，但愿这真的管用。我祈祷着它能够强大到赶走驱使着卡罗尔的怪物。

source: She opened the door.
zh_cn: 门开了。

source: She was in the same dressing gown, just with different stains.
zh_cn: 她还是穿着上次那件晨衣，只是污渍又增加了。

source: I'd heard Ginge say the half-wives had a peculiar odour, and he was right.
zh_cn: 我听京说半妻身上有一种特殊的臭味，现在我知道他是对的了。

source: There was a stench like runny faeces, like someone with a bowel problem.
zh_cn: 我闻到一股排泄物的恶臭，就好像谁得了肠胃病。

source: I began to worry Bodge's repellent would not be strong enough, but I'd already said hello, already looked in Carol's eyes.
zh_cn: 我开始担心波什的喷剂不够强力，但是我已经打了招呼，看向了卡罗尔的眼睛。

source: The replacement was not in view, but Carol had frozen me to the spot.
zh_cn: 我看不见替代者。卡罗尔的一句话却使我僵在那里。

source: "Come to rescue me?" She said.
zh_cn: “你是来救我的？”她说。

source: I nodded, and she backed into the house. I stepped inside.
zh_cn: 我点头，然后跟着她进了屋子。

source: Beyond the smell, it was nice in there, like I remembered it- warm, bright and comforting.
zh_cn: 除了气味，这里的一切依然那么美好，像我记忆中一样——温暖、明亮、舒适。

source: The aliens obviously liked to live well.
zh_cn: 外星人也希望住的好吧。

source: "Carol," I said, and I had the atomiser at the ready.
zh_cn: “卡罗尔，”我说，手中紧握着喷雾器。

source: I saw the folds of her dressing gown begin to fall back as the hiding thing prepared to reveal itself.
zh_cn: 我看见她的晨衣逐渐折叠起皱，那个东西要现身了。

source: "What is it you're so afraid of?" she said, seeing my wide eyes.
zh_cn: “你害怕什么呢？”她看着我旁落的眼神，问道。

source: "You're not you," I said.
zh_cn: “你已经不再是你了，”我说。

source: "You're not who you are."
zh_cn: “你已经不再是你了。”

source: She seemed to glide closer to me, like she was hovering- there was no sound.
zh_cn: 她无声地滑向了我。

source: I was shaking, one hand on the atomiser and one hand held out to ward her off.
zh_cn: 我颤栗着，一手紧握喷雾器，一手架开不断接近的她。

source: I could sense my moment, but I could also feel it slipping away.
zh_cn: 我能感受的我的意识正在溜走。

source: My vision blurred, pulsed, narrowed to just a tiny pinhole focus on Carol and her auburn hair and her large, freckled nose and the gap between the sides of her dressing gown, the creamy white skin of her neck guiding my eyes down and then, before I could stop her, she was inches from me.
zh_cn: 我的视线不断模糊、闪动，缩小到了针眼大小。我看见卡罗尔赤褐色的头发，满是雀斑的大鼻子，还有她晨衣当中的开口。她洁白的脖子引导着我的视线不断向下。在我阻止她之前，她离我已经只有寸许了。

source: My hands were slick with sweat. I lost my grip on the atomiser.
zh_cn: 我的手心满是汗，喷雾器滑落在了地上。

source: "Carol," I said.
zh_cn: “卡罗尔，”我说。

source: "I won't give you my life.
zh_cn: “我不会把我的命交给你的。

source: I won't give up, not even for you."
zh_cn: 我不会放弃，就算是为了你也不行。

source: "Shhhh," she whispered, and she took hold of my free hand and guided it slowly, purposefully, between the folds of her dressing gown and onto her chest.
zh_cn: “嘘，”她轻语道，然后她牵起我空着的手，缓缓引导着它穿过晨衣，按在她的胸上。

source: "Now there," she said.
zh_cn: “好了，”她说。

source: "How frightening is that?"
zh_cn: “还怕么？”

source: And that's when I felt its strange, alien heart beating. And I was lost to the world of men.
zh_cn: 我感受到了外星人不同寻常的心跳，那是我作为人类最后的知觉。
